In [1]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
salary_df = pd.read_csv("Salaries.csv", index_col=0)
salary_df.head()

C:\ProgramData\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3071: DtypeWarning: Columns (12) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
Id,,,,,,,,,,,,
1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [3]:
salary_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 148648 entries, 1 to 148654
Data columns (total 12 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   EmployeeName      148648 non-null  object
 1   JobTitle          148648 non-null  object
 2   BasePay           148043 non-null  float64
 3   OvertimePay       148648 non-null  float64
 4   OtherPay          148648 non-null  float64
 5   Benefits          112490 non-null  float64
 6   TotalPay          148648 non-null  float64
 7   TotalPayBenefits  148648 non-null  float64
 8   Year              148648 non-null  int64
 9   Notes             0 non-null       float64
 10  Agency            148648 non-null  object
 11  Status            38119 non-null   object
dtypes: float64(7), int64(1), object(4)
memory usage: 14.7+ MB

In [4]:
s = salary_df.describe()
s

,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes
count,148043.000000,148648.000000,148648.000000,112490.000000,148648.000000,148648.000000,148648.000000,0.0
mean,66325.398119,5065.821161,3648.761721,25007.777439,74770.035453,93694.776345,2012.522617,NaN
std,42764.898947,11454.266982,8056.655841,15402.235424,50516.440633,62792.743250,1.117526,NaN
min,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000,NaN
25%,33587.350000,0.000000,0.000000,11535.192500,36169.370000,44072.062500,2012.000000,NaN
50%,65007.450000,0.000000,811.205000,28628.365000,71427.130000,92406.020000,2013.000000,NaN
75%,94691.050000,4657.597500,4236.035000,35566.790000,105840.920000,132876.997500,2014.000000,NaN
max,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000,NaN

In [5]:
salary_df["Year"].unique()

array([2011, 2012, 2013, 2014], dtype=int64)

In [6]:
years = salary_df.groupby("Year").sum()["TotalPay"]
years

Year
2011    2.594113e+09
2012    2.724736e+09
2013    2.918656e+09
2014    2.876911e+09
Name: TotalPay, dtype: float64

In [7]:
year_mean = salary_df.groupby("Year").mean()["TotalPay"]
year_mean

Year
2011    71743.819645
2012    74112.234931
2013    77611.443142
2014    75471.836912
Name: TotalPay, dtype: float64

In [8]:
# cumpute the salary diffrence from mean value
pay_diff = []

for i in range(0,(year_mean.count()-1)):
    i += 1
   
    diff = year_mean.iloc[i] - year_mean.iloc[i-1]
    pay_diff.append(diff)
    
print("Total salary cost has increased from year 2011 to 2014",pay_diff)

Total salary cost has increased from year 2011 to 2014 [2368.415285884519, 3499.208211276389, -2139.606229753408]

In [19]:
# top-earning employee across all the years

top_emp = salary_df.groupby('EmployeeName').sum()['TotalPayBenefits']
top_emp.sort_values(ascending=False)

EmployeeName
Kevin Lee           1778487.17
Steven Lee          1706550.76
William Wong        1459954.17
Stanley Lee         1457279.68
Richard Lee         1268668.84
                       ...
Mark W Mcclure            0.00
Timothy E Gibson         -2.73
Mark E Laherty           -8.20
David P Kucia           -33.89
Joe Lopez              -618.13
Name: TotalPayBenefits, Length: 110809, dtype: float64

In [20]:
# Kevin Lee  is the top earning employee